{
  "backend/main.mo": "Motoko canister managing user profiles, locations, and OTP entries with access control and CRUD-style update/query methods.",
  "feature_evidence.json": "Feature evidence manifest listing implemented frontend features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, dark mode variants, and global styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application router setup with protected routes, root layout, and pages for login, role selection, dashboards, and registration.",
  "frontend/src/components/AppBackButton.tsx": "Reusable back button using safe navigation logic with a configurable UI variant.",
  "frontend/src/components/LocationStatusCard.tsx": "UI card showing geolocation permission state, errors, coordinates, and actions to request or refresh location.",
  "frontend/src/components/MobileAppShell.tsx": "Provides mobile layout with header, logout, main content, and conditional bottom navigation.",
  "frontend/src/components/OtpLoginCard.tsx": "Implements phone-based OTP login flow with request, resend, verify, error handling, and demo OTP copy support.",
  "frontend/src/components/ShopOpenClosedToggle.tsx": "Renders two-button toggle for marking a shop as open or closed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAppBackNavigation.ts": "Provides controlled back navigation with fallback routes based on authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication lifecycle, exposing identity, login, logout, and status states.",
  "frontend/src/hooks/useLocationPermission.ts": "Handles geolocation permission state, fetching coordinates, and classifying location errors.",
  "frontend/src/hooks/useOtpChallenge.ts": "Exposes mutations to request and verify OTP codes through the backend actor.",
  "frontend/src/hooks/useOtpSession.ts": "Stores and manages OTP verification state and phone number in localStorage.",
  "frontend/src/hooks/usePersistLastKnownLocation.ts": "Persists authenticated user's last known coordinates to backend when available.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to get and update the caller’s user profile and last known location using the backend actor.",
  "frontend/src/hooks/useShop.ts": "Defines hooks for fetching, registering, and updating the caller’s shop, tied to Internet Identity and backend actor actions.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode styles, scrollbars, and mobile-friendly UI behaviors.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/CustomerHomeFeedPage.tsx": "UI page showing customer home feed with location card, search UI, categories, and placeholders for nearby shops.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login, OTP verification flow, and redirects authenticated users to role selection.",
  "frontend/src/pages/RoleSelectionPage.tsx": "Allows users to choose a role, saves their profile, and redirects based on role or existing profile state.",
  "frontend/src/pages/ShopDashboardPage.tsx": "Displays shop dashboard where owners can register/edit shops, post updates, and toggle shop open status.",
  "frontend/src/pages/ShopRegistrationPage.tsx": "React page for creating or editing a shop, handling form inputs, image upload/preview, validation, and submission using shop and location hooks.",
  "frontend/src/utils/phoneNumber.ts": "Utility functions to validate, normalize, and format Indian phone numbers to E.164 format (+91).",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, fonts, and plugins for the app theme.",
  "project_state.json": "Project metadata describing LocalBuzz app state, requirements, architecture notes, and known issues."
}