{
  "backend/main.mo": "Motoko canister managing user profiles with access control, profile CRUD, and location updates restricted by permissions.",
  "feature_evidence.json": "Feature evidence report describing OTP login changes for India (+91) number normalization and related touched files.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including hooks, pages, components, styles, and utilities.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light/dark theme color tokens and global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with protected routes, layout handling, and navigation logic based on auth and OTP state.",
  "frontend/src/components/LocationStatusCard.tsx": "UI card showing location permission status, coordinates, and controls for requesting or refreshing location.",
  "frontend/src/components/MobileAppShell.tsx": "Authenticated mobile layout with header, logout, main content outlet, and bottom navigation for shop/customer views.",
  "frontend/src/components/OtpLoginCard.tsx": "Renders a two-step phone and OTP login UI with validation, simulated backend calls, and success callback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useLocationPermission.ts": "Requests browser geolocation permission, retrieves coordinates, and tracks permission status and loading/error states.",
  "frontend/src/hooks/useOtpSession.ts": "Manages OTP verification state and stored phone number in localStorage with helpers to set and clear the session.",
  "frontend/src/hooks/usePersistLastKnownLocation.ts": "Sends the user's latest coordinates to the backend when available and reports mutation status.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for user profile and location data using React Query, including save and update mutations.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode palette, and custom utilities including scrollbars and mobile-friendly defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CustomerHomeFeedPage.tsx": "Displays the customer home feed with location status, search UI, categories, and placeholder sections for nearby shops and upcoming features.",
  "frontend/src/pages/LoginPage.tsx": "Login page handling Internet Identity and OTP authentication, redirecting users to role selection once both are verified. Shows loaders, login buttons, and an OTP card.",
  "frontend/src/pages/RoleSelectionPage.tsx": "Lets authenticated OTP users select a role and saves it to their profile, redirecting based on existing or chosen role. Includes loading states and mutation handling.",
  "frontend/src/pages/ShopDashboardPage.tsx": "Static shop dashboard showing location status, quick actions, basic stats, and upcoming features for shop owners.",
  "frontend/src/utils/phoneNumber.ts": "Provides validation, normalization, and display formatting utilities for Indian phone numbers in +91 E.164 format.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL query parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, fonts, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Defines the LocalBuzz app’s current state, including OTP login, role selection, location permission, UI requirements, known issues, existing features, and pending feature requests. Serves as a structured project snapshot for planning and fixes."
}