{
  "backend/main.mo": "Motoko backend defining user profiles, shops, updates, OTP entries, and access‑controlled queries and mutations with storage mixins.",
  "feature_evidence.json": "Feature-evidence report mapping frontend files to feature requirements, components, and confidence levels.",
  "frontend-file-summaries.txt": "List of summarized descriptions for various frontend files and their roles in the application.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with custom LocalBuzz color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, protected routing with OTP and identity checks, and authenticated layout via MobileAppShell.",
  "frontend/src/components/AppBackButton.tsx": "Reusable back button using app-specific navigation fallback logic.",
  "frontend/src/components/LocationStatusCard.tsx": "UI card showing location permission state with badges, guidance text, and actions to request or refresh location.",
  "frontend/src/components/MobileAppShell.tsx": "Provides the main mobile app layout with header, routed content, logout handling, and conditional bottom navigation.",
  "frontend/src/components/OtpLoginCard.tsx": "Implements a two‑step phone and OTP login flow with validation, resend, copy demo code, and success callback.",
  "frontend/src/components/ShopOpenClosedToggle.tsx": "Renders a simple two‑button toggle for marking a shop as open or closed.",
  "frontend/src/components/ShopUpdatePostCard.tsx": "Displays a shop update card with image, status, description, distance, and expiry info.",
  "frontend/src/constants/shopCategories.ts": "Defines the canonical list and type for shop categories used for filtering.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useAppBackNavigation.ts": "Provides safe in‑app back navigation with fallback routes based on authentication state.",
  "frontend/src/hooks/useCustomerHomeFeed.ts": "Fetches, filters, augments, and sorts nearby shop updates based on location and category.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useLocationPermission.ts": "Handles location permission state, errors, and fetching of geolocation coordinates with browser API fallbacks.",
  "frontend/src/hooks/useNotificationPermission.ts": "Provides a hook to check browser notification support, track permission changes, and request permission.",
  "frontend/src/hooks/useOtpChallenge.ts": "Defines mutations for requesting an OTP and verifying it through the actor API.",
  "frontend/src/hooks/useOtpSession.ts": "Manages OTP verification state and phone number persistence using localStorage.",
  "frontend/src/hooks/usePersistLastKnownLocation.ts": "Saves the user's latest coordinates to the backend when identity and location are available.",
  "frontend/src/hooks/useQueries.ts": "Wraps React Query calls for user profile and location data, including mutations that update and invalidate cache.",
  "frontend/src/hooks/useShop.ts": "Provides queries and mutations for fetching, registering, and updating a user's shop via the actor API.",
  "frontend/src/hooks/useShopUpdateNotifications.ts": "Detects new feed items and triggers browser notifications with duplicate and rate‑limit safeguards.",
  "frontend/src/hooks/useShopUpdates.ts": "Fetches all updates for the caller's shop and provides a mutation to create new updates.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm theme palette with light/dark mode variables and custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider setup.",
  "frontend/src/pages/CustomerHomeFeedPage.tsx": "Renders the customer feed with location filtering, categories, and notification controls, integrating multiple hooks.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and OTP verification flow, redirecting authenticated users to role selection.",
  "frontend/src/pages/RoleSelectionPage.tsx": "Lets users choose shop or customer role, saves profile, and redirects based on persisted role with session checks.",
  "frontend/src/pages/ShopDashboardPage.tsx": "Displays shop info, registration state, updates list, and navigation for posting updates and editing shop details.",
  "frontend/src/pages/ShopPostUpdatePage.tsx": "Form for creating shop updates with image upload, validation, and selectable expiry dates.",
  "frontend/src/pages/ShopRegistrationPage.tsx": "Handles creating or editing shop profiles with image upload, location permission, and form validation.",
  "frontend/src/utils/geo.ts": "Provides distance calculations, formatting, and radius checks using the Haversine formula.",
  "frontend/src/utils/notificationStorage.ts": "Manages notification opt-in, enabled timestamp, notified update IDs, and per‑shop daily notification counts using localStorage.",
  "frontend/src/utils/phoneNumber.ts": "Validates and normalizes Indian phone numbers to +91 E.164 format and formats them for display.",
  "frontend/src/utils/time.ts": "Provides date/time helpers for converting to backend nanosecond format, computing future timestamps, and checking expiry.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography and container queries.",
  "project_state.json": "Describes project state, requirements, architecture, issues, and existing features for the LocalBuzz app."
}