{
  "backend/main.mo": "Defines core actor logic including user profiles, shops, shop updates, notifications, storage mixins, and automatic expiration of outdated shop updates.",
  "backend/migration.mo": "Implements migration upgrading shop updates by adding an expiredAt field while preserving all other actor state.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files, mainly describing hooks, pages, components, and styling.",
  "frontend/index.css": "Tailwind base and theme variable definitions using OKLCH tokens for light and dark mode styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, protected routing, and root layout with MobileAppShell for authenticated views.",
  "frontend/src/BUZZ_DESIGN_SYSTEM.md": "Documentation outlining the LocalBuzz design system principles, colors, components, and layout guidelines.",
  "frontend/src/components/AppBackButton.tsx": "Reusable back button component using app back-navigation hook and a styled button with an arrow icon.",
  "frontend/src/components/LocationStatusCard.tsx": "UI card that displays location permission state, errors, coordinates, and actions to request or refresh location.",
  "frontend/src/components/MobileAppShell.tsx": "Provides the mobile app layout with header, navigation, logout handling, and routed content.",
  "frontend/src/components/OtpLoginCard.tsx": "Phone-based OTP login flow with phone input, OTP input, request/resend logic, verification, and demo OTP copy support.",
  "frontend/src/components/ShopOpenClosedToggle.tsx": "Two-button toggle for marking a shop as open or closed.",
  "frontend/src/components/ShopUpdatePostCard.tsx": "Card showing a shop update with title, description, image, distance, expiry info, and optional favorite button.",
  "frontend/src/constants/shopCategories.ts": "Defines the canonical list of shop categories and its type.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAppBackNavigation.ts": "Provides safe back navigation with fallback routes based on authentication state.",
  "frontend/src/hooks/useCustomerFavorites.ts": "React Query hooks to fetch, favorite, unfavorite shops, and check if a shop is favorited.",
  "frontend/src/hooks/useCustomerHomeFeed.ts": "Fetches customer feed updates, computes distances, sorts them, and filters by category.",
  "frontend/src/hooks/useFavoriteShopNotificationCandidates.ts": "Fetches and filters feed updates to find favorited shop notifications beyond 3km but within 10km based on user location.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity restoration.",
  "frontend/src/hooks/useLocationPermission.ts": "Manages geolocation permission state and retrieves coordinates with error handling and permission change tracking.",
  "frontend/src/hooks/useNotificationPermission.ts": "Tracks browser notification permission status and provides a method to request permission.",
  "frontend/src/hooks/useOtpChallenge.ts": "Provides mutations to request an OTP challenge and verify OTP codes via the backend actor.",
  "frontend/src/hooks/useOtpSession.ts": "Stores and manages OTP verification state and phone number in localStorage.",
  "frontend/src/hooks/usePersistLastKnownLocation.ts": "Persists the user's latest coordinates to the backend when identity is available.",
  "frontend/src/hooks/useQueries.ts": "Defines shared queries and mutations for user profiles, locations, notifications, and related backend interactions.",
  "frontend/src/hooks/useShop.ts": "Provides queries and mutations for shop retrieval, registration, updates, and status changes tied to the authenticated owner.",
  "frontend/src/hooks/useShopUpdateNotifications.ts": "Consumes queued shop update notifications, shows browser alerts, dedupes them, and acknowledges them to the backend.",
  "frontend/src/hooks/useShopUpdates.ts": "Provides react-query hooks to fetch, create, update, and delete shop updates using the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, global styles, and custom scrollbar utilities.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/CustomerHomeFeedPage.tsx": "Displays customer feed with location-based shop updates, filtering, notifications, and favorites integration.",
  "frontend/src/pages/CustomerProfilePage.tsx": "Shows customer profile with list of favorite shops and allows removing favorites.",
  "frontend/src/pages/LoginPage.tsx": "Handles login via Internet Identity and OTP verification before navigating to role selection.",
  "frontend/src/pages/RoleSelectionPage.tsx": "Handles user role selection, persists choice in localStorage, saves profile, and redirects based on selected or stored role.",
  "frontend/src/pages/ShopDashboardPage.tsx": "Displays the shop owner dashboard with shop info, update posting, and open/closed status controls.",
  "frontend/src/pages/ShopPostUpdatePage.tsx": "Provides a form for shop owners to create updates with text, images, and expiry settings.",
  "frontend/src/pages/ShopRegistrationPage.tsx": "Allows users to register or edit a shop with details, location, and an optional image.",
  "frontend/src/pages/ShopUpdateDetailPage.tsx": "Shows detailed information for a specific shop update, including image, status, and shop info.",
  "frontend/src/utils/geo.ts": "Contains geospatial helpers for distance calculations, formatting, and radius checks.",
  "frontend/src/utils/notificationStorage.ts": "LocalStorage helpers for notification opt-in state, timestamps, deduped IDs, and legacy per-shop daily counters.",
  "frontend/src/utils/phoneNumber.ts": "Validates and normalizes Indian phone numbers to +91 format and formats them for display.",
  "frontend/src/utils/time.ts": "Converts between JS dates and nanosecond timestamps and provides helpers for expiry checks and formatting.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from hashes.",
  "frontend/tailwind.config.js": "Tailwind setup with custom colors, radius, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing automatic expiry of ShopUpdates via scheduled backend jobs and related requirements."
}