{
  "backend/main.mo": "Motoko actor defining user profiles, shops, OTP entries, and shop updates with access control, storage mixins, and CRUD/query methods for profiles and updates.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including pages, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base configuration defining theme variables, dark mode values, and global styling rules.",
  "frontend/index.html": "Root HTML file containing the mount point and script loader for the React app.",
  "frontend/src/App.tsx": "App-level routing setup with protected routes, authentication checks, and layout handling using TanStack Router.",
  "frontend/src/components/AppBackButton.tsx": "Reusable back button component that triggers safe in-app navigation via a custom hook.",
  "frontend/src/components/LocationStatusCard.tsx": "UI card showing location permission status with badges, guidance, error handling, and controls to request or refresh location.",
  "frontend/src/components/MobileAppShell.tsx": "Layout wrapper providing header, logout, routed content, and conditional bottom navigation for shop and customer views.",
  "frontend/src/components/OtpLoginCard.tsx": "Card component handling phone input, OTP request/verify flow, and demo OTP display with copy functionality.",
  "frontend/src/components/ShopOpenClosedToggle.tsx": "Two-button toggle allowing users to switch a shop’s open or closed state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAppBackNavigation.ts": "Provides safe back navigation with fallback routes based on authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth, login, logout, and stored identities with AuthClient.",
  "frontend/src/hooks/useLocationPermission.ts": "Manages geolocation permission state, errors, and coordinate retrieval with browser APIs.",
  "frontend/src/hooks/useOtpChallenge.ts": "Hooks for requesting and verifying OTP codes through the backend actor using mutations.",
  "frontend/src/hooks/useOtpSession.ts": "Stores and manages OTP verification state and phone number in localStorage.",
  "frontend/src/hooks/usePersistLastKnownLocation.ts": "Persists authenticated users’ latest coordinates to the backend whenever updated.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and updating caller user profiles and last known location via the actor API.",
  "frontend/src/hooks/useShop.ts": "Provides hooks to get, register, and update the caller’s shop using Internet Identity and invalidates related queries.",
  "frontend/src/hooks/useShopUpdates.ts": "Implements hooks to fetch and create shop updates tied to the caller’s shop, with cache invalidation.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, dark mode variables, scrollbars, and mobile-safe layout settings.",
  "frontend/src/main.tsx": "Application entry that sets up React Query, Internet Identity provider, and renders the main App component.",
  "frontend/src/pages/CustomerHomeFeedPage.tsx": "UI page showing welcome text, location status, search/filter controls, categories, and placeholder shop results.",
  "frontend/src/pages/LoginPage.tsx": "Login flow combining Internet Identity authentication with OTP verification before routing to role selection.",
  "frontend/src/pages/RoleSelectionPage.tsx": "Page allowing users to select a role, save their profile, and redirect based on existing or chosen role.",
  "frontend/src/pages/ShopDashboardPage.tsx": "Dashboard page showing shop info, registration/edit actions, posting updates, status toggle, and listing active/expired updates.",
  "frontend/src/pages/ShopPostUpdatePage.tsx": "Form page for creating shop updates with title, description, image upload, expiry selection, validation, and submission.",
  "frontend/src/pages/ShopRegistrationPage.tsx": "Shop registration/edit form handling name, category, address, image upload, location permission, validation, and create/update submission.",
  "frontend/src/utils/phoneNumber.ts": "Utility functions to validate, normalize, and format Indian phone numbers to E.164.",
  "frontend/src/utils/time.ts": "Time utilities for converting dates to backend nanosecond format, computing expiry timestamps, checking active status, and formatting dates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters across navigation, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state, including app summary, architecture notes, known issues, and existing feature metadata for the LocalBuzz mobile app."
}