{
  "backend/main.mo": "Defines user profiles, shops, updates, notifications, and related sorting utilities with state maps and an upgrade hook that expires outdated shop updates.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend source files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light and dark themes and applying global background and text styles.",
  "frontend/index.html": "HTML entry point containing root div and script loader for the React application.",
  "frontend/src/App.tsx": "Configures the app’s routing with protected pages, root layout logic, and integration of the MobileAppShell.",
  "frontend/src/BUZZ_DESIGN_SYSTEM.md": "Documentation outlining the LocalBuzz design system including colors, typography, layout, and component guidelines.",
  "frontend/src/components/AppBackButton.tsx": "Reusable back button component using app navigation hook to provide safe in-app back navigation.",
  "frontend/src/components/LocationStatusCard.tsx": "Renders different location permission states with actions to request or refresh location and shows errors or coordinates.",
  "frontend/src/components/MobileAppShell.tsx": "Provides app layout with header, content area, logout handling, and bottom navigation based on current route.",
  "frontend/src/components/OtpLoginCard.tsx": "Handles phone-based OTP login flow including requesting, verifying, resending OTP, and displaying errors.",
  "frontend/src/components/ShopOpenClosedToggle.tsx": "Simple toggle UI allowing a shop to switch between open and closed states.",
  "frontend/src/components/ShopUpdatePostCard.tsx": "Displays a shop update post with category, distance, optional image, expiry status, and favorite button support.",
  "frontend/src/constants/shopCategories.ts": "Exports the canonical list of shop categories and its associated type.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity changes and invalidates dependent queries when updated.",
  "frontend/src/hooks/useAppBackNavigation.ts": "Provides safe back-navigation logic with fallbacks based on authentication state.",
  "frontend/src/hooks/useCustomerFavorites.ts": "React Query hooks to fetch, favorite, and unfavorite shops, including cache invalidation and favorited checks.",
  "frontend/src/hooks/useCustomerHomeFeed.ts": "Fetches nearby active shop updates, computes distances, sorts them, and optionally filters by category.",
  "frontend/src/hooks/useFavoriteShopNotificationCandidates.ts": "Retrieves updates from favorited shops outside the normal feed radius but within 10km for notification purposes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handles AuthClient creation, login, logout, and identity state management.",
  "frontend/src/hooks/useLocationPermission.ts": "Manages browser location permission state and retrieves current coordinates with error handling.",
  "frontend/src/hooks/useNotificationPermission.ts": "Tracks browser notification permission status and provides a method to request permission.",
  "frontend/src/hooks/useOtpChallenge.ts": "Provides mutations to request an OTP challenge and verify an OTP code via the backend actor.",
  "frontend/src/hooks/useOtpSession.ts": "Stores and manages OTP verification state and phone number in localStorage.",
  "frontend/src/hooks/usePersistLastKnownLocation.ts": "Persists the user's last known location to the backend when identity and coordinates are available.",
  "frontend/src/hooks/useQueries.ts": "Contains various user, location, and notification React Query hooks for fetching and mutating backend data.",
  "frontend/src/hooks/useShop.ts": "Provides shop-related queries and mutations, including fetching, registering, updating, and setting shop status.",
  "frontend/src/hooks/useShopUpdateNotifications.ts": "Handles pending shop-update notifications by showing browser alerts and acknowledging them to avoid duplicates.",
  "frontend/src/hooks/useShopUpdates.ts": "Provides React Query hooks to fetch, create, update, and delete shop updates tied to the current owner’s shop.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes, layout rules, and custom scrollbar styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/CustomerHomeFeedPage.tsx": "Renders the customer feed with location-based shop updates, category filters, favorites, search, and notification opt-in.",
  "frontend/src/pages/CustomerProfilePage.tsx": "Shows the customer profile with a list of favorite shops and allows removing favorites.",
  "frontend/src/pages/LoginPage.tsx": "Implements login flow using Internet Identity and OTP verification before routing to role selection.",
  "frontend/src/pages/RoleSelectionPage.tsx": "Displays role selection, handles OTP session checks, saves user role, and redirects based on stored preferences.",
  "frontend/src/pages/ShopDashboardPage.tsx": "Shows shop info, active/expired updates, and provides actions for registration, posting updates, and toggling shop status.",
  "frontend/src/pages/ShopPostUpdatePage.tsx": "Form for creating shop updates with image upload, expiry selection, validation, and submission handling.",
  "frontend/src/pages/ShopRegistrationPage.tsx": "Handles shop registration or editing with form fields, image upload, validation, and submit logic.",
  "frontend/src/pages/ShopUpdateDetailPage.tsx": "Displays detailed view of a shop update with status, image, shop info, and handles loading and missing-update cases.",
  "frontend/src/utils/geo.ts": "Provides distance calculation, formatting, and radius checking utilities using the Haversine formula.",
  "frontend/src/utils/notificationStorage.ts": "Utilities for storing notification opt-in state, timestamps, notified IDs, and per-shop daily counts in localStorage.",
  "frontend/src/utils/phoneNumber.ts": "Validates and normalizes Indian phone numbers to E.164 format and formats them for display.",
  "frontend/src/utils/time.ts": "Helpers for converting between JS dates and backend nanosecond timestamps and checking/formatting expiry times.",
  "frontend/src/utils/urlParams.ts": "Functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, layout settings, custom animations, and plugin usage.",
  "project_state.json": "Project metadata describing current state, issues, and existing features related to fixing the search input."
}