{
  "kind": "build_request",
  "title": "Fix Role Selection buttons not navigating (Continue as Shop Owner / Continue as Customer)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Fix the Role Selection page so tapping/clicking \"Continue as Shop Owner\" or \"Continue as Customer\" always performs a visible action and navigates to the correct route (/shop-dashboard or /customer-home) instead of appearing to do nothing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Either Continue as shop owner or continue as customer is not opening."
        ]
      },
      "acceptanceCriteria": [
        "From /role-selection, clicking \"Continue as Shop Owner\" navigates to /shop-dashboard.",
        "From /role-selection, clicking \"Continue as Customer\" navigates to /customer-home.",
        "While the selection is being processed, the selected button shows a loading state and repeated taps do not trigger duplicate actions.",
        "If navigation cannot proceed for any reason, show an English, user-visible error message (not only console logging)."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Add robust handling on the Role Selection page for missing OTP session phone number (localStorage cleared, etc.): show an English message explaining the session is incomplete and route the user back to the login page to re-verify OTP.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Either Continue as shop owner or continue as customer is not opening."
        ]
      },
      "acceptanceCriteria": [
        "If the user taps a role and the OTP phone number is missing, the UI shows an English error (e.g., \"Your session expired. Please log in again.\") and navigates to /.",
        "The app does not silently fail with only console errors in this case."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Ensure Role Selection does not block navigation on a backend profile-save failure: if saving the profile fails, still route the user to the selected destination and show an English non-blocking warning that profile sync failed and can be retried later.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Either Continue as shop owner or continue as customer is not opening."
        ]
      },
      "acceptanceCriteria": [
        "If saveCallerUserProfile fails (trap/network/actor unavailable), the app still navigates to the selected route.",
        "An English warning message is shown indicating the profile could not be saved.",
        "The role selection buttons remain usable after a failure (no permanent disabled state)."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Fix the Role Selection auto-redirect logic so it does not incorrectly force users to /customer-home on load regardless of their intent; only auto-redirect when a previously chosen role is unambiguous, otherwise keep the user on the Role Selection screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Either Continue as shop owner or continue as customer is not opening."
        ]
      },
      "acceptanceCriteria": [
        "Opening /role-selection does not immediately redirect the user away unless the app can confidently determine the user’s role selection state.",
        "The Role Selection screen remains reachable after login when role is not clearly set."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only and must be composed).",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor in backend/main.mo; only add a migration if an actual stable-state change is required."
  ],
  "nonGoals": [
    "Adding new roles/permissions to the backend authorization system beyond what is required to make role selection navigation work.",
    "Implementing third-party auth providers or any non-Internet-Identity authentication.",
    "Adding new product features unrelated to role selection navigation (e.g., new pages, new feed behavior)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}