{
  "kind": "build_request",
  "title": "Fix 'Search shops' so users can type and filter the customer feed",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the non-editable \"Search shops...\" control on the Customer Home Feed page with a real text input that accepts typing and focus, while keeping the same general layout (search field on the left, filter button on the right).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Not able to type anything in Search shop"
        ]
      },
      "acceptanceCriteria": [
        "On /customer-home, the search control is an <input> (or equivalent) that can be focused and accepts keyboard input on desktop and mobile.",
        "Tapping/clicking the search field places the cursor in the field and the on-screen keyboard opens on mobile.",
        "The search field has an accessible label (e.g., aria-label=\"Search shops\") and a visible placeholder text \"Search shops...\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement client-side filtering of the displayed feed items on the Customer Home Feed page based on the entered search text (case-insensitive), without requiring any backend changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Not able to type anything in Search shop"
        ]
      },
      "acceptanceCriteria": [
        "When the user types in the search field, the list of rendered feed cards updates to show only items whose shop text matches the query (case-insensitive).",
        "Clearing the search text restores the full set of items (subject to existing category/location filters).",
        "If the current search yields zero matches, show a clear empty state message in English (e.g., \"No shops match your search.\")."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an in-field clear control (e.g., an X button) for the search input that clears the query and returns focus to the input, and ensure it does not interfere with typing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Not able to type anything in Search shop"
        ]
      },
      "acceptanceCriteria": [
        "A clear control is only visible/enabled when the search query is non-empty.",
        "Clicking/tapping the clear control empties the field and keeps focus in the input so the user can continue typing.",
        "The clear control is keyboard accessible and has an accessible label (e.g., aria-label=\"Clear search\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources); compose using existing components or implement page-local markup/styling in the page file.",
    "No backend changes are required for this fix."
  ],
  "nonGoals": [
    "Implementing server-side search or adding new backend query endpoints for search.",
    "Changing the existing category filter behavior beyond combining it with the new search filter.",
    "Implementing the Filter button behavior (it can remain as-is unless already implemented elsewhere)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}