{
  "kind": "build_request",
  "title": "Automatic expiry for ShopUpdates (deactivate at expiryDate)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend scheduled process that runs every 10 minutes and automatically expires ShopUpdates: find all ShopUpdates where isActive == true and expiryDate <= current canister time, then set isActive = false and set expiredAt = current timestamp. Expired ShopUpdates must not be deleted.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Run every 10 minutes.\n\nQuery the ShopUpdates collection where:\n\nisActive == true\n\nexpiryDate <= currentTime\n\nFor each matched document:\n\nSet isActive = false\n\nAdd expiredAt = currentTimestamp\n\nDo NOT delete expired documents."
        ]
      },
      "acceptanceCriteria": [
        "Given at least one ShopUpdate with isActive=true and expiryDate in the past, within 10 minutes after the scheduled process runs, the ShopUpdate is persisted with isActive=false.",
        "When a ShopUpdate is expired by the scheduled process, an expiredAt timestamp is set to the time the expiration ran.",
        "No ShopUpdate records are removed from storage as part of expiry processing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Extend the backend ShopUpdate data model to store when an update was expired by adding an optional expiredAt field (null when not expired). Ensure any existing persisted ShopUpdates remain readable after upgrade and default to expiredAt = null if missing.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add expiredAt = currentTimestamp"
        ]
      },
      "acceptanceCriteria": [
        "New ShopUpdates created after this change have expiredAt = null initially.",
        "When a ShopUpdate is auto-expired, expiredAt becomes non-null.",
        "After a canister upgrade, previously stored ShopUpdates (created before this feature) still load successfully and have expiredAt = null unless already expired by the new logic."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure all backend APIs used for customer-facing feeds only return currently active, unexpired ShopUpdates (isActive == true AND expiryDate > current canister time), so expired updates are automatically removed from the Customer Home Feed without requiring frontend changes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ensure expired updates are automatically removed from Customer Home Feed.\n   (Feed must only query where isActive == true AND expiryDate > current time)"
        ]
      },
      "acceptanceCriteria": [
        "Customer home feed backend method(s) return no ShopUpdates where isActive=false.",
        "Customer home feed backend method(s) return no ShopUpdates where expiryDate <= current canister time.",
        "If an update becomes expired (either by time check or the scheduled process), it no longer appears in the feed results."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not delete expired ShopUpdate records; only mark them inactive and timestamp expiration.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding an external database index (e.g., Firestore/SQL indexes) or any external cron/cloud function provider.",
    "Building analytics/history UIs for expired ShopUpdates.",
    "Real-time expiration updates via websockets/push mechanisms beyond the existing polling/query model."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}