{
  "kind": "build_request",
  "title": "Implement the requested Shop Dashboard UI (Post Update, Open/Closed toggle, Active/Expired posts sections)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Update the Shop Dashboard page to match the requested simple layout by adding: (1) a primary button labeled \"Post Update\", (2) a toggle control to mark the shop as \"Open\" or \"Closed\", (3) a section titled \"My Active Posts\", and (4) a section titled \"Expired Posts\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create Shop Dashboard with:\n\n1. Button: \"Post Update\"\n2. Toggle Button: Mark Shop Open / Closed\n3. Section: My Active Posts\n4. Section: Expired Posts\n\nKeep layout simple and easy to use."
        ]
      },
      "acceptanceCriteria": [
        "On route /shop-dashboard, the page shows a visible \"Post Update\" button.",
        "On route /shop-dashboard, the page shows a toggle control with clear states \"Open\" and \"Closed\" (English text).",
        "On route /shop-dashboard, the page shows a section labeled \"My Active Posts\".",
        "On route /shop-dashboard, the page shows a section labeled \"Expired Posts\".",
        "The overall layout is mobile-first, uncluttered, and easy to scan (simple vertical stacking, consistent spacing)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure the Shop Dashboard still supports the existing shop registration/edit entrypoint: when the caller has no shop record, show a clear CTA to register; when a shop exists, allow navigating to the shop registration page to edit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Step 3: Shop Dashboard"
        ]
      },
      "acceptanceCriteria": [
        "If no shop is returned for the current caller, the dashboard shows a clear register CTA that navigates to /shop-registration.",
        "If a shop is returned for the current caller, the dashboard shows an edit action that navigates to /shop-registration.",
        "These registration/edit controls do not conflict with or hide the required \"Post Update\", \"Open/Closed\" toggle, and the two posts sections."
      ]
    },
    {
      "id": "REQ-20",
      "text": "For \"My Active Posts\" and \"Expired Posts\" sections, implement simple empty states (English text) when there are no items, without adding backend persistence yet.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Section: My Active Posts\n4. Section: Expired Posts"
        ]
      },
      "acceptanceCriteria": [
        "If there are no active posts to display, \"My Active Posts\" shows an empty-state message in English (e.g., \"No active posts yet\").",
        "If there are no expired posts to display, \"Expired Posts\" shows an empty-state message in English (e.g., \"No expired posts\").",
        "No backend APIs, state schema, or persistence are introduced for posts as part of this change."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Keep the backend as a single Motoko actor in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Implementing actual post creation, storage, expiration logic, or a posts feed backed by the canister.",
    "Persisting the Open/Closed state to the backend (unless separately requested later).",
    "Adding product catalog, inventory management, or analytics features beyond the requested Shop Dashboard elements."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}