{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shop Dashboard UI update (Post Update, Open/Closed toggle, Active/Expired posts sections)",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Simplify /shop-dashboard layout and add Post Update button, Open/Closed toggle, and Active/Expired posts sections.",
      "acceptanceCriteria": [
        "On route /shop-dashboard, the page shows a visible \"Post Update\" button.",
        "On route /shop-dashboard, the page shows a toggle control with clear states \"Open\" and \"Closed\" (English text).",
        "On route /shop-dashboard, the page shows a section labeled \"My Active Posts\".",
        "On route /shop-dashboard, the page shows a section labeled \"Expired Posts\".",
        "The overall layout is mobile-first, uncluttered, and easy to scan (simple vertical stacking, consistent spacing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopDashboardPage.tsx",
          "operation": "modify",
          "description": "Replace the current dashboard content (quick actions, stats, coming soon) with the requested simple, mobile-first vertical layout. Use existing shadcn/ui primitives already imported (Button, Card, CardHeader, CardTitle, CardDescription, CardContent) to compose: (1) a primary \"Post Update\" button, (2) an Open/Closed toggle control with clear English labels, (3) a \"My Active Posts\" section, and (4) an \"Expired Posts\" section. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ShopOpenClosedToggle.tsx",
          "operation": "create",
          "description": "Create a small presentational React component that renders an accessible Open/Closed toggle UI (e.g., two-button segmented control) using existing shadcn/ui Button styling (no edits under frontend/src/components/ui). This component should accept current state and onChange callback; state remains local to the dashboard (no persistence). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ShopDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the new ShopOpenClosedToggle component into the dashboard above the posts sections, keep all user-facing text in English, and ensure the toggle is visually clear in both states. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Preserve shop registration/edit entrypoint behavior on the dashboard without hiding new required controls.",
      "acceptanceCriteria": [
        "If no shop is returned for the current caller, the dashboard shows a clear register CTA that navigates to /shop-registration.",
        "If a shop is returned for the current caller, the dashboard shows an edit action that navigates to /shop-registration.",
        "These registration/edit controls do not conflict with or hide the required \"Post Update\", \"Open/Closed\" toggle, and the two posts sections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopDashboardPage.tsx",
          "operation": "modify",
          "description": "Keep the existing shop fetch logic (useGetCallerShop) and ensure the register CTA (when shop is null) and edit action (when shop exists) remain present and navigate to /shop-registration, while also keeping \"Post Update\", the Open/Closed toggle, and both posts sections visible on the page regardless of shop existence (controls may be disabled with explanatory English helper text if needed, but must remain visible). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add simple English empty states for Active/Expired posts sections with no backend persistence.",
      "acceptanceCriteria": [
        "If there are no active posts to display, \"My Active Posts\" shows an empty-state message in English (e.g., \"No active posts yet\").",
        "If there are no expired posts to display, \"Expired Posts\" shows an empty-state message in English (e.g., \"No expired posts\").",
        "No backend APIs, state schema, or persistence are introduced for posts as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopDashboardPage.tsx",
          "operation": "modify",
          "description": "Implement the \"My Active Posts\" and \"Expired Posts\" sections as simple UI containers (e.g., Cards) that render fixed empty-state messages in English when there are no items (use local placeholder arrays or constant empty arrays; do not add React Query hooks or backend calls for posts). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}