{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Role Selection navigation, session handling, and redirect logic",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Make Role Selection buttons reliably navigate with visible loading state, duplicate-tap prevention, and user-visible error handling.",
      "acceptanceCriteria": [
        "From /role-selection, clicking \"Continue as Shop Owner\" navigates to /shop-dashboard.",
        "From /role-selection, clicking \"Continue as Customer\" navigates to /customer-home.",
        "While the selection is being processed, the selected button shows a loading state and repeated taps do not trigger duplicate actions.",
        "If navigation cannot proceed for any reason, show an English, user-visible error message (not only console logging)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoleSelectionPage.tsx",
          "operation": "modify",
          "description": "Refactor role selection click handlers to (1) set an explicit per-button \"processing\" state, (2) guard against duplicate selections while processing, (3) ensure navigation is always invoked for the chosen role when allowed, and (4) show an English in-page error message when a click cannot proceed (instead of only console logging). Also ensure Card click and Button click share the same guarded handler so the UI always produces a visible result."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Handle missing OTP-session phone number on role selection by showing an English session-expired message and routing back to login.",
      "acceptanceCriteria": [
        "If the user taps a role and the OTP phone number is missing, the UI shows an English error (e.g., \"Your session expired. Please log in again.\") and navigates to /.",
        "The app does not silently fail with only console errors in this case."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoleSelectionPage.tsx",
          "operation": "modify",
          "description": "On role tap, detect missing OTP session phone number and immediately show an English error message (e.g., session expired/incomplete). Then route the user to the login route (/). Ensure this path is user-visible (rendered message) and does not rely on console errors."
        },
        {
          "path": "frontend/src/hooks/useOtpSession.ts",
          "operation": "modify",
          "description": "Add/adjust a helper to fully clear OTP session state in a way that Role Selection can invoke when it detects missing/incomplete session (e.g., ensure both verified flag and phone number are cleared consistently), so the app reliably returns to the login flow."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Do not block navigation if saving the user profile fails; navigate anyway and show a non-blocking English warning.",
      "acceptanceCriteria": [
        "If saveCallerUserProfile fails (trap/network/actor unavailable), the app still navigates to the selected route.",
        "An English warning message is shown indicating the profile could not be saved.",
        "The role selection buttons remain usable after a failure (no permanent disabled state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoleSelectionPage.tsx",
          "operation": "modify",
          "description": "Change the save+navigate flow so that a save failure does not prevent routing: catch save errors, show an English non-blocking warning (rendered in the page), reset any processing/disabled state, and still navigate to the chosen destination route. Ensure repeated use remains possible after failures."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Fix Role Selection auto-redirect so it only redirects when a previously chosen role is unambiguous; otherwise remain on Role Selection.",
      "acceptanceCriteria": [
        "Opening /role-selection does not immediately redirect the user away unless the app can confidently determine the user’s role selection state.",
        "The Role Selection screen remains reachable after login when role is not clearly set."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RoleSelectionPage.tsx",
          "operation": "modify",
          "description": "Replace the current unconditional auto-redirect-to-customer logic with an unambiguous check (e.g., a persisted role choice in browser storage set when the user previously selected a role). Only auto-navigate when that persisted choice is present and valid; otherwise render the Role Selection screen without redirecting."
        },
        {
          "path": "frontend/src/components/MobileAppShell.tsx",
          "operation": "modify",
          "description": "On logout, also clear any persisted role-selection hint used for Role Selection auto-redirect, to prevent incorrect redirects for subsequent sessions and to keep /role-selection reachable when role is not clearly set."
        }
      ]
    }
  ]
}