{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shop Owner: Create and view ShopUpdates with expiry + optional image (frontend)",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Add a protected \"Post Update\" page with a validated form (title, optional description, optional image preview, and expiry selection).",
      "acceptanceCriteria": [
        "A new route/page exists for creating a Shop Update and is only accessible within the authenticated/protected app shell (consistent with existing protected routes).",
        "The form validates that Title is required and is short (client-side constraint with a clear English error message).",
        "Description is optional.",
        "Image upload is optional and provides an in-page preview when selected.",
        "Expiry option UI offers exactly: Today, 2 Days, and Custom Date (date picker).",
        "All user-facing text is English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopPostUpdatePage.tsx",
          "operation": "create",
          "description": "Create the new protected Shop Owner \"Post Update\" page containing a form for Title (required, short), optional Description, optional Image upload with preview (use the blob-storage ExternalBlob workflow for image representation; Verify the component's usage instructions before implementing.), and an Expiry selector offering exactly Today / 2 Days / Custom Date (date input). Ensure all user-facing strings are English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the new /shop-post-update route and wrap it with the existing ProtectedRoute so it is only accessible inside the authenticated/protected app shell. Ensure the new page is reachable via in-app navigation (no orphan page)."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Wire Post Update submission to the backend via React Query mutation with loading, error, success confirmation, navigation back, and cache invalidation.",
      "acceptanceCriteria": [
        "A new React Query mutation exists for creating a ShopUpdate.",
        "While submitting, the submit button is disabled and a visible loading state is shown.",
        "On backend error, the UI shows a clear English error message and does not navigate away.",
        "On success, the UI shows a clear English success message and then returns the user to the Shop Dashboard (or clears the form for another post) without breaking auth/session state.",
        "After success, any cached ShopUpdates list queries used by the dashboard are invalidated/refetched so the new post appears."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useShopUpdates.ts",
          "operation": "create",
          "description": "Add React Query hooks for ShopUpdates: a createShopUpdate mutation that calls the backend capability to create an update using the caller’s current shopId, plus list query hooks used by the dashboard. On mutation success, invalidate/refetch the relevant ShopUpdates query cache keys so the dashboard reflects the new post. (Use blob-storage ExternalBlob for optional image upload payload handling; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/ShopPostUpdatePage.tsx",
          "operation": "modify",
          "description": "Connect the form submit to the new React Query mutation. Show a disabled submit button and a visible loading indicator while pending; show clear English error text on failure and stay on the page; show a clear English success confirmation on success and then navigate back to the Shop Dashboard (or reset the form) while preserving the auth/session state."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Update the Shop Dashboard to fetch and render real ShopUpdates as Active vs Expired, preserving existing English empty states.",
      "acceptanceCriteria": [
        "The Shop Dashboard fetches the caller’s ShopUpdates and splits them into Active vs Expired based on Expiry Date.",
        "When updates exist, each section renders a simple list of posts showing at minimum: Title and Expiry Date; if an image exists, show a small thumbnail/preview.",
        "When no updates exist for a section, the existing English empty state remains visible.",
        "The existing behavior that disables \"Post Update\" when the owner has no shop remains intact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the existing \"Post Update\" button to navigate to /shop-post-update while keeping the current disable behavior when the owner has no shop. Fetch the caller’s ShopUpdates using the new useShopUpdates hook(s), split them into Active vs Expired based on expiryDate relative to now, and render lists showing Title + Expiry Date, plus an image thumbnail when present (use blob-storage ExternalBlob.getDirectURL(); Verify the component's usage instructions before implementing.). Preserve the existing English empty-state content when a section has zero items."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Implement consistent client-side expiry timestamp conversion for Today / 2 Days / Custom Date and enforce Custom Date selection before submit.",
      "acceptanceCriteria": [
        "Selecting Today results in an expiryDate that is on the current calendar day (implementation-defined exact time, but must not be in the past).",
        "Selecting 2 Days results in an expiryDate approximately 48 hours in the future (must be later than now).",
        "Selecting Custom Date requires a date to be chosen; the form cannot submit without it when Custom Date is selected.",
        "The backend stores expiryDate in a consistent timestamp format (Time.Time) and uses it for active/expired classification."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/time.ts",
          "operation": "create",
          "description": "Add utilities to convert JavaScript dates/options into the backend Time.Time bigint format used by the app (e.g., helpers for: end-of-today (not in the past), now + ~48h, and a chosen calendar date). Include helpers for comparing backend Time.Time values to \"now\" for active/expired classification."
        },
        {
          "path": "frontend/src/pages/ShopPostUpdatePage.tsx",
          "operation": "modify",
          "description": "Use the new time utilities to compute expiryDate based on the selected option. Enforce that Custom Date requires a chosen date and block submission with a clear English validation error when missing. Ensure Today and 2 Days always compute an expiryDate later than now."
        },
        {
          "path": "frontend/src/pages/ShopDashboardPage.tsx",
          "operation": "modify",
          "description": "Use the shared time utilities when splitting updates into Active vs Expired to ensure consistent classification logic with the timestamps produced by the Post Update form."
        }
      ]
    }
  ]
}