{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Implement automatic expiry for ShopUpdates so updates deactivate when expiryDate is reached via a scheduled backend job; keep expired documents for analytics/history.",
  "architectural_notes": [
    "Add a scheduled backend job (cron/cloud scheduler) running every 10 minutes to find ShopUpdates where isActive=true and expiryDate <= now, then set isActive=false and expiredAt=now; do not delete expired docs.",
    "Optimize expiry lookup with a database index on (isActive, expiryDate).",
    "Customer Home Feed should only query active, unexpired ShopUpdates (isActive=true AND expiryDate > now) so expired items disappear automatically."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Automatic expiry system for ShopUpdates (scheduled job deactivates updates at expiryDate, sets expiredAt, retains records)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a backend scheduled process that runs every 10 minutes and automatically expires ShopUpdates: find all ShopUpdates where isActive == true and expiryDate <= current canister time, then set isActive = false and set expiredAt = current timestamp. Expired ShopUpdates must not be deleted.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Extend the backend ShopUpdate data model to store when an update was expired by adding an optional expiredAt field (null when not expired). Ensure any existing persisted ShopUpdates remain readable after upgrade and default to expiredAt = null if missing.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Ensure all backend APIs used for customer-facing feeds only return currently active, unexpired ShopUpdates (isActive == true AND expiryDate > current canister time), so expired updates are automatically removed from the Customer Home Feed without requiring frontend changes.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Automatic expiry for ShopUpdates (deactivate at expiryDate)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}